---
kind: property
id: P:Autodesk.Revit.DB.Electrical.AreaBasedLoadType.LoadClassification
source: html/fd08a05b-e697-a519-60f8-e40a888e5bcb.htm
---
# Autodesk.Revit.DB.Electrical.AreaBasedLoadType.LoadClassification Property

The load classification of area based load type.

## Syntax (C#)
```csharp
public ElementId LoadClassification { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: The id is not a load classification id .
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null